Revit 2027 API
AlignmentStationLabelOptions.LeaderShoulder Property
 Specifies the leader shoulder point, in model coordinates. The default value is null. When null, the shoulder point will be the same as the Origin point, driven by the Station value.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LeaderShoulder { get; set; }
Public Property LeaderShoulder As XYZ
	Get
	Set
public:
property XYZ^ LeaderShoulder {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LeaderShoulder : XYZ with get, set
Property Value
XYZ
See Also
Reference
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace